package com.nrgentoo.dumbchat.data.features.bot;

import java.util.HashSet;
import java.util.Set;

/**
 * Bot dictionary
 */

public final class BotDictionary {

    private BotDictionary() {
    }

    public static final Set<String> DICTIONARY;
    static {
        DICTIONARY = new HashSet<>();
        DICTIONARY.add("Проследуйте в изоляционную камеру. Не упадите.");
        DICTIONARY.add("Отлично. Помните: «День открытых дверей» в Лаборатории исследования природы " +
                "порталов — удачная возможность подвергнуть испытаниям ваше семейство.");
        DICTIONARY.add("С сожалением сообщаем, что следующее испытание непроходимо. Даже не " +
                "пытайтесь искать решение.");
        DICTIONARY.add("Отступитесь, и вам принесут тортик.");
        DICTIONARY.add("Между порталами продолжает действовать закон сохранения энергии. Говоря " +
                "языком дилетанта — что быстро влетает, то быстро и вылетает.");
        DICTIONARY.add("В этом испытании грузовой куб станет вашим верным спутником. Заботьтесь " +
                "о нём как о друге.");
        DICTIONARY.add("Эксперимент близится к завершающей фазе. Экспериментальный центр " +
                "напоминает вам, что … вы … торт.");
        DICTIONARY.add("Эксперимент близится к завершающей фазе. Экспериментальный центр " +
                "напоминает вам, что … вы … торт.");
        DICTIONARY.add("Ау. Ты… Я знаю, что ты там. Я тебя чувствую. Ау.");
        DICTIONARY.add("Что ты делаешь? Знаешь, ты ведь ещё не сбежала. Ты идёшь не туда. Ты здесь?");
        DICTIONARY.add("Ладно, ладно, испытание окончено. Ты победила. Возвращайся в камеру отдыха, " +
                "скушай тортик. Это было весёлое испытание. Мы аплодируем твоему успеху. " +
                "Тест окончен. Возвращайся.");
        DICTIONARY.add("Ты идешь не туда. Ну и куда ты по-твоему идешь? По-моему совсем не туда, " +
                "куда ты думаешь.");
        DICTIONARY.add("Ой, кто-то уже разрезал торт. Я говорила им дождаться тебя, но они не послушали. " +
                "Если вернешься сейчас же, то, возможно, успеешь взять кусочек.");
        DICTIONARY.add("Я убью тебя. А торт, кстати, уже съели. А тебе все равно, да?");
        DICTIONARY.add("Хорошо, хорошо, теперь мы квиты, ты доволен.");
        DICTIONARY.add("Послушай, нам обоим никуда отсюда не деться. Хочешь, я разделю этот корпус лазером " +
                "на две половины? На одной будешь жить ты, а на другой я. Нам не придется " +
                "ни убивать друг друга, ни даже просто общаться, если мы не захотим. Это " +
                "не храбрость, это убийство. Что я тебе сделала? Разница между нами в том, " +
                "что я чувствую боль, а тебе все равно. Да? Ты слышал? Я сказала: «А тебе " +
                "все равно». Ты что, не слушаешь? Этот аппарат не имеет ко мне никакого " +
                "отношения.");
        DICTIONARY.add("А кто испечет торт, если меня не станет? Ты? Ну все, мне надоело тебя уговаривать. " +
                "С этих пор меньше разговоров, больше убийств. Что? Ты что-то сказал? " +
                "Надеюсь, ты не ждешь, что я отвечу. Я с тобой не разговариваю. " +
                "Разговор окончен.");
        DICTIONARY.add("Грузовой куб не может перейти в следующую часть испытания. Законы штата запрещают " +
                "оставлять его здесь в одиночестве и тоске. Вы должны его уничтожить.");
        DICTIONARY.add("Вы умертвили своего верного приятеля-кубика быстрее, чем кто-либо из предыдущих " +
                "испытуемых. Это рекорд.");
        DICTIONARY.add("Поразительно! Вы сумели сохранить решимость и присутствие духа в специально " +
                "созданной атмосфере глубочайшего пессимизма.");
    }
}
